<template lang="pug">
	div
		h1
			| Портфолио-резюме
			br
			span
				| Сорокин Евгений Николаевич
		.sides
			.leftSide
				.aboutMe
					p
						| Добрый день! Последние несколько лет, параллельно работе учу создание сайтов. Проходил удаленные курсы по верстке (2,5 месяца - раз в неделю), проходил пару лет назад курсы по html/css от htmlacademy (31 курс, 541 задание, общий прогрес - 41%). Учился по видео Юрия Артюха (2 сайта - верстка, 1 сайт перевод на Vue Cli). Учился по бесплатным интенсивам WebCademy. Делал сайт по урока FrontCoder. 
					p
						| Ищу учителя, наставника, товарища. Для меня мир frontend-разработки как океан, и себя я представляю как неумеющего плавать, которого закинули в воду чтобы он пока догреб до берега научился плавать, но в своей "грёбле" я не вижу берегов и  даже не представляю в правильную ли сторону гребу...
					p
						| Стараюсь с каждой работой наращивать свои знания, как цепочку - в каждом коде приходится находить что-то новое, что потом использую в следующем коде. Будь то просто синтаксис или относительно сложная наработка.
			.rightSide
				img(src="@/assets/logo.png" alt="Сорокин Е.Н.")
				a(href="#")
					| Ссылка на GitHub


</template>

<script>
export default {
  name: "display1"
};
</script>
