<template lang="pug">
	div.container
		.header__wrap
			h1
				| Портфолио-резюме
				br
				span
					| Сорокин Евгений Николаевич
				br
				br
				a(href="#")
					| Ссылка на GitHub
				br
				a(href="https://ewgenij87snwork.github.io/rezume/")
					| Ссылка на Facebook
			.rightSide
				img(src="@/assets/155_bg_450px_419px.jpg" alt="Сорокин Е.Н.")
		.sides
			.leftSide
				.aboutMe
					p
						| Мне нравится работать над созданием сайтов, т.к. это открывает бескрайнюю тропу -- "Путь Знания". Последние несколько лет, параллельно работе учусь создавать сайты. К сожалению, знаний и практики за такой длительный срок скопилось не достаточно -- то забрасывал на время и многое забывал, то просто после 8-10 часовой работы днями зацыкливался на непроходимых вещах. Проходил удаленные курсы по верстке (2,5 месяца - раз в неделю), проходил пару лет назад курсы по html/css от htmlacademy (31 курс, 541 задание, общий прогрес - 41%). Учился по видео Юрия Артюха (2 сайта - верстка, 1 сайт перевод на Vue Cli). Учился по бесплатным интенсивам WebCademy. Делал сайт по уроках FrontCoder. 
					p
						| Сейчах хочу найти работу и жилье в Киеве с наставником/ментором. Т.к. неструктурированные знания быстро забываются -- имею много пробелов в Html/Css/Front-End/верстке. Считаю нужным выполнить минимум 2 проекта вслед за старшим работником прежде чем приступать к живому проекту.
					p
						| Ищу учителя, наставника, товарища. Для меня мир frontend-разработки как океан, и себя я представляю как неумеющего плавать, которого закинули в воду чтобы он пока догреб до берега научился плавать, но в своей "грёбле" я не вижу берегов и  даже не представляю в правильную ли сторону учусь...
					p
						| Стараюсь с каждой работой наращивать свои знания, как цепочку - в каждом коде приходится находить что-то новое, что потом использую в следующем коде. Будь то просто синтаксис или относительно сложная наработка.




</template>

<script>
export default {
  name: "display1"
};
</script>
<style scoped lang="sass">
.container
	max-width: 940px
	margin: 0 auto
	height: 100vh
	min-height: 500px
	position: relative

.header__wrap
	display: flex
	justify-content: space-between
	margin-bottom: 50px
	h1
		align-self: center
		a
			font-size: .7em


.sides
	display: flex
.rightSide
	img
		max-width: 250px
		border-radius: 15%
		// border: 3px dashed green
</style>
